<script lang="ts">
  export let texts: Texts = { contacts: '', payment: '', order: '' };
  export let amount: number = 0;
  export let client: Client = {};

  console.info(texts);

  /**
   * Настройка:
   *
   * если можно вычислить сумму предоплаты:
   * давать выбор внести предоплату или оставить заявку
   * только внести предоплату, заявка невозможна
   *
   * Текст когда контактных данных нет:
   * Оставьте ваши контактные данные, они будут переданы турагенту, и он свяжется с вами
   *
   * Текст предоплаты:
   * После внесения предоплаты наш менеджер получит сообщение о блокировке суммы на Вашей карте и начнет бронирование тура.
   * Если менеджер забронирует тур сумма предоплаты будет списана с Вашей карты и Вы получите фискальный кассовый чек. Менеджер свяжется с Вами и договорится о получение оставшейся сумму оплаты и передаче документов.
   * Если, по каким-то причинам, бронирование тура невозможно, сумма предоплаты будет разблокированаи вернется на Вашу карту.
   *
   * Текст заявки:
   * Заявка ни к чему вас не обязывает и не является бронированием. Получив заявку, наш менеджер уточнит наличие тура и свяжется с вами.
   *
   */
</script>

<div class="well well-large sell-form">форма с настройками</div>

<p>
  {@html texts.contacts}
</p>
<p>
  {@html texts.payment}
</p>
<p>
  {@html texts.order}
</p>
